## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 6 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                             NAME                                             |
|--------|----------------------------------------------------------------------------------------------|
| add    | `module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets[&quot;10.0.32.0/19&quot;]`              |
|        | `module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets[&quot;10.0.64.0/19&quot;]`              |
|        | `module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets[&quot;10.0.96.0/19&quot;]`              |
|        | `module.vpn.aws_ec2_client_vpn_network_association.this_subnets[&quot;subnet-0c7d18c0c51b28b61&quot;]` |
|        | `module.vpn.aws_ec2_client_vpn_network_association.this_subnets[&quot;subnet-0c91f7c6b8211904b&quot;]` |
|        | `module.vpn.aws_ec2_client_vpn_network_association.this_subnets[&quot;subnet-0cecd9e634daf82d3&quot;]` |
| delete | `module.vpn.aws_ec2_client_vpn_network_association.this_subnets[&quot;subnet-001e585d12cce4d1e&quot;]` |
|        | `module.vpn.aws_ec2_client_vpn_network_association.this_subnets[&quot;subnet-08de34a9e1a7458dc&quot;]` |
|        | `module.vpn.aws_ec2_client_vpn_network_association.this_subnets[&quot;subnet-0af8b8402f1d605ff&quot;]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets["10.0.32.0/19"] will be created
  + resource "aws_ec2_client_vpn_authorization_rule" "this_subnets" {
      + access_group_id        = (sensitive value)
      + client_vpn_endpoint_id = "cvpn-endpoint-09a79e8845a82dbf3"
      + description            = "Rule name: 10.0.32.0/19"
      + id                     = (known after apply)
      + target_network_cidr    = "10.0.32.0/19"
    }

  # module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets["10.0.64.0/19"] will be created
  + resource "aws_ec2_client_vpn_authorization_rule" "this_subnets" {
      + access_group_id        = (sensitive value)
      + client_vpn_endpoint_id = "cvpn-endpoint-09a79e8845a82dbf3"
      + description            = "Rule name: 10.0.64.0/19"
      + id                     = (known after apply)
      + target_network_cidr    = "10.0.64.0/19"
    }

  # module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets["10.0.96.0/19"] will be created
  + resource "aws_ec2_client_vpn_authorization_rule" "this_subnets" {
      + access_group_id        = (sensitive value)
      + client_vpn_endpoint_id = "cvpn-endpoint-09a79e8845a82dbf3"
      + description            = "Rule name: 10.0.96.0/19"
      + id                     = (known after apply)
      + target_network_cidr    = "10.0.96.0/19"
    }

  # module.vpn.aws_ec2_client_vpn_network_association.this_subnets["subnet-001e585d12cce4d1e"] will be destroyed
  # (because key ["subnet-001e585d12cce4d1e"] is not in for_each map)
  - resource "aws_ec2_client_vpn_network_association" "this_subnets" {
      - association_id         = "cvpn-assoc-03fc64a2c500dd4b9" -> null
      - client_vpn_endpoint_id = "cvpn-endpoint-09a79e8845a82dbf3" -> null
      - id                     = "cvpn-assoc-03fc64a2c500dd4b9" -> null
      - subnet_id              = "subnet-001e585d12cce4d1e" -> null
      - vpc_id                 = "vpc-097508d1f5e243195" -> null
    }

  # module.vpn.aws_ec2_client_vpn_network_association.this_subnets["subnet-08de34a9e1a7458dc"] will be destroyed
  # (because key ["subnet-08de34a9e1a7458dc"] is not in for_each map)
  - resource "aws_ec2_client_vpn_network_association" "this_subnets" {
      - association_id         = "cvpn-assoc-0017d2ca75427e2fa" -> null
      - client_vpn_endpoint_id = "cvpn-endpoint-09a79e8845a82dbf3" -> null
      - id                     = "cvpn-assoc-0017d2ca75427e2fa" -> null
      - subnet_id              = "subnet-08de34a9e1a7458dc" -> null
      - vpc_id                 = "vpc-097508d1f5e243195" -> null
    }

  # module.vpn.aws_ec2_client_vpn_network_association.this_subnets["subnet-0af8b8402f1d605ff"] will be destroyed
  # (because key ["subnet-0af8b8402f1d605ff"] is not in for_each map)
  - resource "aws_ec2_client_vpn_network_association" "this_subnets" {
      - association_id         = "cvpn-assoc-03b273db07dac4779" -> null
      - client_vpn_endpoint_id = "cvpn-endpoint-09a79e8845a82dbf3" -> null
      - id                     = "cvpn-assoc-03b273db07dac4779" -> null
      - subnet_id              = "subnet-0af8b8402f1d605ff" -> null
      - vpc_id                 = "vpc-097508d1f5e243195" -> null
    }

  # module.vpn.aws_ec2_client_vpn_network_association.this_subnets["subnet-0c7d18c0c51b28b61"] will be created
  + resource "aws_ec2_client_vpn_network_association" "this_subnets" {
      + association_id         = (known after apply)
      + client_vpn_endpoint_id = "cvpn-endpoint-09a79e8845a82dbf3"
      + id                     = (known after apply)
      + subnet_id              = "subnet-0c7d18c0c51b28b61"
      + vpc_id                 = (known after apply)
    }

  # module.vpn.aws_ec2_client_vpn_network_association.this_subnets["subnet-0c91f7c6b8211904b"] will be created
  + resource "aws_ec2_client_vpn_network_association" "this_subnets" {
      + association_id         = (known after apply)
      + client_vpn_endpoint_id = "cvpn-endpoint-09a79e8845a82dbf3"
      + id                     = (known after apply)
      + subnet_id              = "subnet-0c91f7c6b8211904b"
      + vpc_id                 = (known after apply)
    }

  # module.vpn.aws_ec2_client_vpn_network_association.this_subnets["subnet-0cecd9e634daf82d3"] will be created
  + resource "aws_ec2_client_vpn_network_association" "this_subnets" {
      + association_id         = (known after apply)
      + client_vpn_endpoint_id = "cvpn-endpoint-09a79e8845a82dbf3"
      + id                     = (known after apply)
      + subnet_id              = "subnet-0cecd9e634daf82d3"
      + vpc_id                 = (known after apply)
    }

Plan: 6 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
